#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCustomizationSlotButton

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C
// 0x0138 (0x0D28 - 0x0BF0)
class UAthenaCustomizationSlotButton_C final : public UAthenaCustomizationSlotSelectorButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnBackedOutFromSelection;                          // 0x0BF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnConfirmedSelection;                              // 0x0C00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelected;                                        // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0C10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionFlash;                             // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionShine;                             // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_Empty;                                       // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InactiveFilledSlot;                                // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNormalBangWrapper_C*                   NormalBangWrapper;                                 // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Plus;                                         // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               UnsavedBang;                                       // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TooltipBody;                                       // 0x0C50(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   TooltipHeader;                                     // 0x0C68(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          ShowSubTypeIcon;                                   // 0x0C80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_C81[0x7];                                      // 0x0C81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SubTypeIcon;                                       // 0x0C88(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bSuppressTooltip;                                  // 0x0D10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_D11[0x3];                                      // 0x0D11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TypeIconVerticalOffset;                            // 0x0D14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ImageEmptyMID;                                     // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WidthThreshold;                                    // 0x0D20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaCustomizationSlotButton(int32 EntryPoint);
	void OnCardImageAndWidthChanged(const TSoftObjectPtr<class UTexture2D>& Image, float Width);
	void Save_State_Updated(bool bSaved);
	void OnCustomizationSlotActiveStateChanged(bool bInAttachableCosmeticAvailable, bool bInActive);
	void Construct();
	void HandleActiveStateChanged(bool CosmeticAvailable, bool Active);
	class FString GetSlotDebugName();
	void HandleWidthChanged(float Width);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaCustomizationSlotButton_C">();
	}
	static class UAthenaCustomizationSlotButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationSlotButton_C>();
	}
};
static_assert(alignof(UAthenaCustomizationSlotButton_C) == 0x000008, "Wrong alignment on UAthenaCustomizationSlotButton_C");
static_assert(sizeof(UAthenaCustomizationSlotButton_C) == 0x000D28, "Wrong size on UAthenaCustomizationSlotButton_C");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, UberGraphFrame) == 0x000BF0, "Member 'UAthenaCustomizationSlotButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, OnBackedOutFromSelection) == 0x000BF8, "Member 'UAthenaCustomizationSlotButton_C::OnBackedOutFromSelection' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, OnConfirmedSelection) == 0x000C00, "Member 'UAthenaCustomizationSlotButton_C::OnConfirmedSelection' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, OnSelected) == 0x000C08, "Member 'UAthenaCustomizationSlotButton_C::OnSelected' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, OnHover) == 0x000C10, "Member 'UAthenaCustomizationSlotButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, ConfirmSelectionFlash) == 0x000C18, "Member 'UAthenaCustomizationSlotButton_C::ConfirmSelectionFlash' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, ConfirmSelectionShine) == 0x000C20, "Member 'UAthenaCustomizationSlotButton_C::ConfirmSelectionShine' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, Image_Empty) == 0x000C28, "Member 'UAthenaCustomizationSlotButton_C::Image_Empty' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, InactiveFilledSlot) == 0x000C30, "Member 'UAthenaCustomizationSlotButton_C::InactiveFilledSlot' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, NormalBangWrapper) == 0x000C38, "Member 'UAthenaCustomizationSlotButton_C::NormalBangWrapper' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, Text_Plus) == 0x000C40, "Member 'UAthenaCustomizationSlotButton_C::Text_Plus' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, UnsavedBang) == 0x000C48, "Member 'UAthenaCustomizationSlotButton_C::UnsavedBang' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, TooltipBody) == 0x000C50, "Member 'UAthenaCustomizationSlotButton_C::TooltipBody' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, TooltipHeader) == 0x000C68, "Member 'UAthenaCustomizationSlotButton_C::TooltipHeader' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, ShowSubTypeIcon) == 0x000C80, "Member 'UAthenaCustomizationSlotButton_C::ShowSubTypeIcon' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, SubTypeIcon) == 0x000C88, "Member 'UAthenaCustomizationSlotButton_C::SubTypeIcon' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, bSuppressTooltip) == 0x000D10, "Member 'UAthenaCustomizationSlotButton_C::bSuppressTooltip' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, TypeIconVerticalOffset) == 0x000D14, "Member 'UAthenaCustomizationSlotButton_C::TypeIconVerticalOffset' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, ImageEmptyMID) == 0x000D18, "Member 'UAthenaCustomizationSlotButton_C::ImageEmptyMID' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotButton_C, WidthThreshold) == 0x000D20, "Member 'UAthenaCustomizationSlotButton_C::WidthThreshold' has a wrong offset!");

}

