#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Player_CoolCarpet

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "PopOutStates_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Athena_Player_CoolCarpet.Athena_Player_CoolCarpet_C.ExecuteUbergraph_Athena_Player_CoolCarpet
// 0x0688 (0x0688 - 0x0000)
struct Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetCharacterOwner_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetCharacterOwner_ReturnValue_1;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsTargeting_ReturnValue;               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsTargeting_ReturnValue_1;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_2;        // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_3;        // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_2;        // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_5;                // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_3;        // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_157[0x1];                                      // 0x0157(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue_2;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_196[0x2];                                      // 0x0196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0198(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x01A8(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue_3;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_3;                     // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x01EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x01F0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_AimDownSights;                  // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0280(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(bool bIsTargeting)>            K2Node_CreateDelegate_OutputDelegate_2;            // 0x030C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            K2Node_CustomEvent_NewWeapon;                      // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            K2Node_CustomEvent_PrevWeapon;                     // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlaybackPosition_ReturnValue;          // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Strength;                             // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_MoveUpAndDown;                        // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0345(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0346(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_347[0x1];                                      // 0x0347(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0348(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0358(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0368(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthena_Fake_CoolCarpet_C*              K2Node_DynamicCast_AsAthena_Fake_Cool_Carpet;      // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Prop;                           // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_Prop_CoolCarpet_C*              K2Node_DynamicCast_AsAthena_Prop_Cool_Carpet;      // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPopOutStates                                 K2Node_CustomEvent_PopState_3;                     // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopOutStates                                 K2Node_CustomEvent_PopState_2;                     // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopOutStates                                 K2Node_CustomEvent_PopState_1;                     // 0x03AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE[0x2];                                      // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x03B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCrouchedLoc_ReturnValue;               // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x03FC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0410(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0438(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWeaponHolstered_ReturnValue;            // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0450(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0464(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2; // 0x046C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_3; // 0x0474(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_1; // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_OldLocation;                          // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_OldVelocity;                          // 0x0494(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_3;  // 0x04A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_3;     // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x04B4(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue_1;                  // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA[0x6];                                      // 0x04DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_4;  // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_2; // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_3; // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopOutStates                                 K2Node_CustomEvent_PopState;                       // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502[0x2];                                      // 0x0502(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0504(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCrouchedLoc_ReturnValue_1;             // 0x0510(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_4;  // 0x0520(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_4;     // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_532[0x6];                                      // 0x0532(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_5;  // 0x0538(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_4; // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0545(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_546[0x2];                                      // 0x0546(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue;        // 0x0548(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_6;                // 0x055C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0568(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0574(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortWeapon*                            K2Node_CustomEvent_Weapon_1;                       // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            K2Node_CustomEvent_Weapon;                         // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortWeapon* Weapon)>    K2Node_CreateDelegate_OutputDelegate_8;            // 0x0610(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortWeapon* Weapon)>    K2Node_CreateDelegate_OutputDelegate_9;            // 0x0620(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortWeapon* Weapon)>    K2Node_CreateDelegate_OutputDelegate_10;           // 0x0630(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortWeapon* Weapon)>    K2Node_CreateDelegate_OutputDelegate_11;           // 0x0640(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortWeapon* Weapon)>    K2Node_CreateDelegate_OutputDelegate_12;           // 0x0650(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortWeapon* Weapon)>    K2Node_CreateDelegate_OutputDelegate_13;           // 0x0660(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* Prop)>           K2Node_CreateDelegate_OutputDelegate_14;           // 0x0670(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x0681(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x0682(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x0683(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet) == 0x000008, "Wrong alignment on Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet");
static_assert(sizeof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet) == 0x000688, "Wrong size on Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, EntryPoint) == 0x000000, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000008, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000018, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_GetCharacterOwner_ReturnValue) == 0x000030, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_GetCharacterOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_GetWeaponData_ReturnValue) == 0x000038, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_GetWeaponData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_GetCharacterOwner_ReturnValue_1) == 0x000040, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_GetCharacterOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasTag_ReturnValue) == 0x000048, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_GetIsTargeting_ReturnValue) == 0x00004A, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_GetIsTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000050, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000060, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BooleanOR_ReturnValue) == 0x000061, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BooleanOR_ReturnValue_1) == 0x000074, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BooleanAND_ReturnValue) == 0x000075, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_GetWeaponData_ReturnValue_1) == 0x000078, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_GetWeaponData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_GetIsTargeting_ReturnValue_1) == 0x000080, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_GetIsTargeting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BooleanOR_ReturnValue_2) == 0x000081, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasTag_ReturnValue_1) == 0x000082, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_Not_PreBool_ReturnValue_1) == 0x000083, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000084, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_VSize_ReturnValue) == 0x000090, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Roll) == 0x000094, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Pitch) == 0x000098, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Yaw) == 0x00009C, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000A0, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_MakeRotator_ReturnValue) == 0x0000A4, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000B0, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasAuthority_ReturnValue) == 0x0000B1, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000B4, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Roll_1) == 0x0000C0, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Pitch_1) == 0x0000C4, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Yaw_1) == 0x0000C8, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000CC, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_MakeRotator_ReturnValue_1) == 0x0000D0, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000DC, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x0000E0, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_MakeRotator_ReturnValue_2) == 0x0000E4, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000F0, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_MakeRotator_ReturnValue_3) == 0x0000F4, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_K2_GetActorRotation_ReturnValue_2) == 0x000100, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_K2_GetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Roll_2) == 0x00010C, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Pitch_2) == 0x000110, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Yaw_2) == 0x000114, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_K2_GetActorRotation_ReturnValue_3) == 0x000118, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_K2_GetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_MakeRotator_ReturnValue_4) == 0x000124, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Roll_3) == 0x000130, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Pitch_3) == 0x000134, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BreakRotator_Yaw_3) == 0x000138, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_K2_SetActorRotation_ReturnValue_2) == 0x00013C, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_K2_SetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_MakeRotator_ReturnValue_5) == 0x000140, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_MakeRotator_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_K2_SetActorRotation_ReturnValue_3) == 0x00014C, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_K2_SetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_IsLocallyControlled_ReturnValue) == 0x00014D, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_VSize_ReturnValue_1) == 0x000150, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000154, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasAuthority_ReturnValue_1) == 0x000155, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000156, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_MakeVector_ReturnValue) == 0x000158, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_MakeVector_ReturnValue_1) == 0x000164, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_GetWeaponData_ReturnValue_2) == 0x000170, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_GetWeaponData_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasTag_ReturnValue_2) == 0x000178, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_Not_PreBool_ReturnValue_2) == 0x000179, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasAuthority_ReturnValue_2) == 0x00017A, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x00017B, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000180, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000190, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_RowToBool_ReturnValue) == 0x000191, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_Not_PreBool_ReturnValue_3) == 0x000192, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_Not_PreBool_ReturnValue_4) == 0x000193, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_Not_PreBool_ReturnValue_5) == 0x000194, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_BooleanAND_ReturnValue_1) == 0x000195, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, K2Node_MakeArray_Array) == 0x000198, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x0001A8, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0001C8, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0001D8, "Member 'Athena_Player_CoolCarpet_C_ExecuteUbergraph_Athena_Player_CoolCarpet::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
