#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLockerTab

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaLockerTab.AthenaLockerTab_C.ExecuteUbergraph_AthenaLockerTab
// 0x0240 (0x0240 - 0x0000)
struct AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Using_Gamepad;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButtonWrapper_C* CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0050(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0088(0x0018)()
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00A8(0x0018)()
	bool                                          CallFunc_IsInputMethodActive_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAthenaCustomizationSlotButtonWrapper_C* ButtonWrapper, EAthenaCustomizationCategory CustomizationType, class FText BannerLabel, class FText CustomizationDescription, int32 SubslotIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButtonWrapper_C* CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButtonWrapper_C* CallFunc_Array_Get_Item_2;                         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButton* Button, const struct FAthenaCustomizationParams& CustomizationParams)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaBannerSelectModal_C*             CallFunc_Create_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaCustomizationSlotButtonWrapper_C*> K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable_3;                               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* CallFunc_Array_Get_Item_3;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_LoadoutName;                          // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsShuffleTile;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSaved;                               // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0180(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x0198(0x0018)()
	struct FAthenaCustomizationParams             K2Node_MakeStruct_AthenaCustomizationParams;       // 0x01B0(0x0048)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButtonWrapper_C* CallFunc_Array_Get_Item_4;                         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScratchPadSlotSaved_ReturnValue;        // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCosmeticLoadoutCard_C*                 K2Node_DynamicCast_AsCosmetic_Loadout_Card;        // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoloButton_C*                          K2Node_DynamicCast_AsSolo_Button;                  // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab) == 0x000008, "Wrong alignment on AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab");
static_assert(sizeof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab) == 0x000240, "Wrong size on AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, EntryPoint) == 0x000000, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_CustomEvent_Using_Gamepad) == 0x000004, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_CustomEvent_Using_Gamepad' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_int_Variable) == 0x000008, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_int_Variable_1) == 0x00000C, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_int_Variable_2) == 0x000018, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Array_Get_Item) == 0x000028, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_bool_Variable) == 0x000048, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_byte_Variable) == 0x000049, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_byte_Variable_1) == 0x00004A, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_bool_Variable_1) == 0x00004B, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_byte_Variable_2) == 0x00004C, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_byte_Variable_3) == 0x00004D, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_bool_Variable_2) == 0x00004E, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_text_Variable) == 0x000050, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_bool_Variable_3) == 0x000068, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_text_Variable_1) == 0x000070, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_text_Variable_2) == 0x000088, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000A0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Select_Default) == 0x0000A8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_IsInputMethodActive_ReturnValue) == 0x0000C0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_IsInputMethodActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_int_Array_Index_Variable) == 0x0000C4, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_bUsingGamepad) == 0x0000C8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000CC, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Array_Length_ReturnValue_2) == 0x0000E8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000EC, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Array_Get_Item_2) == 0x0000F0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Array_Length_ReturnValue_3) == 0x0000F8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000FC, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_CreateDelegate_OutputDelegate_2) == 0x000100, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_GetContext_ReturnValue) == 0x000110, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000118, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Create_ReturnValue) == 0x000120, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_ComponentBoundEvent_Button_2) == 0x000128, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_ComponentBoundEvent_Button_1) == 0x000130, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_PlayAnimationForward_ReturnValue) == 0x000138, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_MakeArray_Array) == 0x000140, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_int_Variable_3) == 0x000150, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Add_IntInt_ReturnValue_3) == 0x000154, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Array_Get_Item_3) == 0x000158, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Less_IntInt_ReturnValue_3) == 0x000160, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000161, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_IsActivated_ReturnValue) == 0x000162, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_IsDesignTime) == 0x000163, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_LoadoutName) == 0x000168, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_LoadoutName' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_bIsShuffleTile) == 0x000178, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_bIsShuffleTile' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_bSaved) == 0x000179, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_bSaved' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Select_Default_1) == 0x00017A, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Select_Default_2) == 0x00017B, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00017C, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Conv_StringToText_ReturnValue) == 0x000180, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Select_Default_3) == 0x000198, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_MakeStruct_AthenaCustomizationParams) == 0x0001B0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_MakeStruct_AthenaCustomizationParams' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_int_Loop_Counter_Variable) == 0x0001F8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Array_Get_Item_4) == 0x000200, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Add_IntInt_ReturnValue_4) == 0x000208, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_IsScratchPadSlotSaved_ReturnValue) == 0x00020C, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_IsScratchPadSlotSaved_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Array_Length_ReturnValue_4) == 0x000210, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Less_IntInt_ReturnValue_4) == 0x000214, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_ComponentBoundEvent_Button) == 0x000218, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_DynamicCast_AsCosmetic_Loadout_Card) == 0x000220, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_DynamicCast_AsCosmetic_Loadout_Card' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_DynamicCast_bSuccess) == 0x000228, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_DynamicCast_AsSolo_Button) == 0x000230, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_DynamicCast_AsSolo_Button' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_DynamicCast_bSuccess_1) == 0x000238, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.Update Solo Button
// 0x0001 (0x0001 - 0x0000)
struct AthenaLockerTab_C_Update_Solo_Button final
{
public:
	bool                                          Using_Gamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLockerTab_C_Update_Solo_Button) == 0x000001, "Wrong alignment on AthenaLockerTab_C_Update_Solo_Button");
static_assert(sizeof(AthenaLockerTab_C_Update_Solo_Button) == 0x000001, "Wrong size on AthenaLockerTab_C_Update_Solo_Button");
static_assert(offsetof(AthenaLockerTab_C_Update_Solo_Button, Using_Gamepad) == 0x000000, "Member 'AthenaLockerTab_C_Update_Solo_Button::Using_Gamepad' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.BndEvt__Button_Loadouts_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLockerTab_C_BndEvt__Button_Loadouts_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_BndEvt__Button_Loadouts_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLockerTab_C_BndEvt__Button_Loadouts_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLockerTab_C_BndEvt__Button_Loadouts_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLockerTab_C_BndEvt__Button_Loadouts_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLockerTab_C_BndEvt__Button_Loadouts_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLockerTab_C_BndEvt__Button_Loadouts_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.OnScratchPadSaveStateUpdated
// 0x0001 (0x0001 - 0x0000)
struct AthenaLockerTab_C_OnScratchPadSaveStateUpdated final
{
public:
	bool                                          bSaved;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLockerTab_C_OnScratchPadSaveStateUpdated) == 0x000001, "Wrong alignment on AthenaLockerTab_C_OnScratchPadSaveStateUpdated");
static_assert(sizeof(AthenaLockerTab_C_OnScratchPadSaveStateUpdated) == 0x000001, "Wrong size on AthenaLockerTab_C_OnScratchPadSaveStateUpdated");
static_assert(offsetof(AthenaLockerTab_C_OnScratchPadSaveStateUpdated, bSaved) == 0x000000, "Member 'AthenaLockerTab_C_OnScratchPadSaveStateUpdated::bSaved' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.OnRefreshForNewLoadout
// 0x0018 (0x0018 - 0x0000)
struct AthenaLockerTab_C_OnRefreshForNewLoadout final
{
public:
	class FString                                 LoadoutName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bIsShuffleTile;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLockerTab_C_OnRefreshForNewLoadout) == 0x000008, "Wrong alignment on AthenaLockerTab_C_OnRefreshForNewLoadout");
static_assert(sizeof(AthenaLockerTab_C_OnRefreshForNewLoadout) == 0x000018, "Wrong size on AthenaLockerTab_C_OnRefreshForNewLoadout");
static_assert(offsetof(AthenaLockerTab_C_OnRefreshForNewLoadout, LoadoutName) == 0x000000, "Member 'AthenaLockerTab_C_OnRefreshForNewLoadout::LoadoutName' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_OnRefreshForNewLoadout, bIsShuffleTile) == 0x000010, "Member 'AthenaLockerTab_C_OnRefreshForNewLoadout::bIsShuffleTile' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaLockerTab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLockerTab_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaLockerTab_C_PreConstruct");
static_assert(sizeof(AthenaLockerTab_C_PreConstruct) == 0x000001, "Wrong size on AthenaLockerTab_C_PreConstruct");
static_assert(offsetof(AthenaLockerTab_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaLockerTab_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLockerTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLockerTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLockerTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLockerTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLockerTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLockerTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLockerTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLockerTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLockerTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLockerTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLockerTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLockerTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaLockerTab_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLockerTab_C_OnInputModeChanged) == 0x000001, "Wrong alignment on AthenaLockerTab_C_OnInputModeChanged");
static_assert(sizeof(AthenaLockerTab_C_OnInputModeChanged) == 0x000001, "Wrong size on AthenaLockerTab_C_OnInputModeChanged");
static_assert(offsetof(AthenaLockerTab_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'AthenaLockerTab_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.HandleSlotHovered
// 0x00B8 (0x00B8 - 0x0000)
struct AthenaLockerTab_C_HandleSlotHovered final
{
public:
	class UAthenaCustomizationSlotButtonWrapper_C* HoveredSlot;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaCustomizationCategory                  Type;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HeaderText;                                        // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   DescriptionText;                                   // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         SubslotIndex;                                      // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetCampaignHeroPartItem_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCategoryDisplayName_ReturnValue;       // 0x0058(0x0018)()
	class UFortItem*                              CallFunc_GetFavoriteItemForCategory_ReturnValue;   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OkToReshowOnHover_Ok;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowEmptyForType_bCanShowEmpty;        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLockerTab_C_HandleSlotHovered) == 0x000008, "Wrong alignment on AthenaLockerTab_C_HandleSlotHovered");
static_assert(sizeof(AthenaLockerTab_C_HandleSlotHovered) == 0x0000B8, "Wrong size on AthenaLockerTab_C_HandleSlotHovered");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, HoveredSlot) == 0x000000, "Member 'AthenaLockerTab_C_HandleSlotHovered::HoveredSlot' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, Type) == 0x000008, "Member 'AthenaLockerTab_C_HandleSlotHovered::Type' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, HeaderText) == 0x000010, "Member 'AthenaLockerTab_C_HandleSlotHovered::HeaderText' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, DescriptionText) == 0x000028, "Member 'AthenaLockerTab_C_HandleSlotHovered::DescriptionText' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, SubslotIndex) == 0x000040, "Member 'AthenaLockerTab_C_HandleSlotHovered::SubslotIndex' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_IsActivated_ReturnValue) == 0x000044, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000045, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_GetCampaignHeroPartItem_ReturnValue) == 0x000048, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_GetCampaignHeroPartItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_GetCategoryDisplayName_ReturnValue) == 0x000058, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_GetCategoryDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_GetFavoriteItemForCategory_ReturnValue) == 0x000070, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_GetFavoriteItemForCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000079, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000080, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_OkToReshowOnHover_Ok) == 0x000088, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_OkToReshowOnHover_Ok' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000089, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'AthenaLockerTab_C_HandleSlotHovered::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000A0, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000A8, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_HandleSlotHovered, CallFunc_CanShowEmptyForType_bCanShowEmpty) == 0x0000B0, "Member 'AthenaLockerTab_C_HandleSlotHovered::CallFunc_CanShowEmptyForType_bCanShowEmpty' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.ShowVaultItemByCategory
// 0x01C0 (0x01C0 - 0x0000)
struct AthenaLockerTab_C_ShowVaultItemByCategory final
{
public:
	EAthenaCustomizationCategory                  CustomizationType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubslotIndex;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanShowEmpty;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetFavoriteItemForCategory_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHomebaseUIContext*                 CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              CallFunc_GetSlottedPrimaryHero_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0070(0x0028)(HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_2;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_3;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortAthenaLoadout                     CallFunc_GetLoadoutForPlayer_ReturnValue;          // 0x00A8(0x00F0)()
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_4;                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpProfileAthena*                  CallFunc_GetAthenaProfile_ReturnValue;             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCharacterItemDefinition*         CallFunc_GetRandomDefaultAthenaCharacterDefinition_ReturnValue; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_5;                 // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_ShowVaultItemByCategory) == 0x000008, "Wrong alignment on AthenaLockerTab_C_ShowVaultItemByCategory");
static_assert(sizeof(AthenaLockerTab_C_ShowVaultItemByCategory) == 0x0001C0, "Wrong size on AthenaLockerTab_C_ShowVaultItemByCategory");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CustomizationType) == 0x000000, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CustomizationType' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, SubslotIndex) == 0x000004, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::SubslotIndex' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CanShowEmpty) == 0x000008, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CanShowEmpty' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CallFunc_GetFavoriteItemForCategory_ReturnValue) == 0x000010, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CallFunc_GetFavoriteItemForCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000020, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CallFunc_GetSubGame_ReturnValue) == 0x000028, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000038, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CallFunc_GetSlottedPrimaryHero_ReturnValue) == 0x000040, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CallFunc_GetSlottedPrimaryHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CallFunc_GetItemDefinitionBP_ReturnValue_1) == 0x000048, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CallFunc_GetItemDefinitionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, CallFunc_GetContext_ReturnValue_1) == 0x000058, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000060, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ShowVaultItemByCategory, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'AthenaLockerTab_C_ShowVaultItemByCategory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
