#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChallengeMapRewardPreview

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaChallengeMapRewardPreview.AthenaChallengeMapRewardPreview_C
// 0x0038 (0x0378 - 0x0340)
class UAthenaChallengeMapRewardPreview_C final : public UAthenaMapChallengeRewardPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SwitchIntro;                                       // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SwitchOutro;                                       // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 GradientBackgroundReward;                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          WaitingForHide;                                    // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaChallengeMapRewardPreview(int32 EntryPoint);
	void OutroFinish();
	void ReplayIntroAnim();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void SetPreviewVisible(bool bVisible);
	void StopAllAnims();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaChallengeMapRewardPreview_C">();
	}
	static class UAthenaChallengeMapRewardPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengeMapRewardPreview_C>();
	}
};
static_assert(alignof(UAthenaChallengeMapRewardPreview_C) == 0x000008, "Wrong alignment on UAthenaChallengeMapRewardPreview_C");
static_assert(sizeof(UAthenaChallengeMapRewardPreview_C) == 0x000378, "Wrong size on UAthenaChallengeMapRewardPreview_C");
static_assert(offsetof(UAthenaChallengeMapRewardPreview_C, UberGraphFrame) == 0x000340, "Member 'UAthenaChallengeMapRewardPreview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeMapRewardPreview_C, SwitchIntro) == 0x000348, "Member 'UAthenaChallengeMapRewardPreview_C::SwitchIntro' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeMapRewardPreview_C, SwitchOutro) == 0x000350, "Member 'UAthenaChallengeMapRewardPreview_C::SwitchOutro' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeMapRewardPreview_C, Outro) == 0x000358, "Member 'UAthenaChallengeMapRewardPreview_C::Outro' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeMapRewardPreview_C, Intro) == 0x000360, "Member 'UAthenaChallengeMapRewardPreview_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeMapRewardPreview_C, GradientBackgroundReward) == 0x000368, "Member 'UAthenaChallengeMapRewardPreview_C::GradientBackgroundReward' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeMapRewardPreview_C, WaitingForHide) == 0x000370, "Member 'UAthenaChallengeMapRewardPreview_C::WaitingForHide' has a wrong offset!");

}

