#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChallengeMapRewardPreview

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaChallengeMapRewardPreview.AthenaChallengeMapRewardPreview_C.ExecuteUbergraph_AthenaChallengeMapRewardPreview
// 0x0048 (0x0048 - 0x0000)
struct AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bVisible;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview) == 0x000008, "Wrong alignment on AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview");
static_assert(sizeof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview) == 0x000048, "Wrong size on AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview, EntryPoint) == 0x000000, "Member 'AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview, K2Node_CustomEvent_bVisible) == 0x000014, "Member 'AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview::K2Node_CustomEvent_bVisible' has a wrong offset!");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview, K2Node_Event_Animation) == 0x000028, "Member 'AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview, CallFunc_IsVisible_ReturnValue) == 0x000031, "Member 'AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview, CallFunc_PlayAnimation_ReturnValue_2) == 0x000038, "Member 'AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview, CallFunc_PlayAnimation_ReturnValue_3) == 0x000040, "Member 'AthenaChallengeMapRewardPreview_C_ExecuteUbergraph_AthenaChallengeMapRewardPreview::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

// Function AthenaChallengeMapRewardPreview.AthenaChallengeMapRewardPreview_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct AthenaChallengeMapRewardPreview_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengeMapRewardPreview_C_OnAnimationFinished) == 0x000008, "Wrong alignment on AthenaChallengeMapRewardPreview_C_OnAnimationFinished");
static_assert(sizeof(AthenaChallengeMapRewardPreview_C_OnAnimationFinished) == 0x000008, "Wrong size on AthenaChallengeMapRewardPreview_C_OnAnimationFinished");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_OnAnimationFinished, Animation) == 0x000000, "Member 'AthenaChallengeMapRewardPreview_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function AthenaChallengeMapRewardPreview.AthenaChallengeMapRewardPreview_C.SetPreviewVisible
// 0x0001 (0x0001 - 0x0000)
struct AthenaChallengeMapRewardPreview_C_SetPreviewVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaChallengeMapRewardPreview_C_SetPreviewVisible) == 0x000001, "Wrong alignment on AthenaChallengeMapRewardPreview_C_SetPreviewVisible");
static_assert(sizeof(AthenaChallengeMapRewardPreview_C_SetPreviewVisible) == 0x000001, "Wrong size on AthenaChallengeMapRewardPreview_C_SetPreviewVisible");
static_assert(offsetof(AthenaChallengeMapRewardPreview_C_SetPreviewVisible, bVisible) == 0x000000, "Member 'AthenaChallengeMapRewardPreview_C_SetPreviewVisible::bVisible' has a wrong offset!");

}

