#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_UncleBrolly

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_UncleBrolly.B_UncleBrolly_C.ExecuteUbergraph_B_UncleBrolly
// 0x02C8 (0x02C8 - 0x0000)
struct B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Hide;                           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkydiving_ReturnValue;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_CurrentPoise;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility;    // 0x0064(0x0008)(NoDestructor)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_1;  // 0x006C(0x0008)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_2;  // 0x0078(0x0008)(NoDestructor)
	TArray<struct FWeaponHudKeyActionVisibility>  K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0090(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              K2Node_Event_ImpactPhysicalSurface;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     K2Node_Event_SpawnedPSC;                           // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x01D8(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Current_Poise;                  // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02A0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly) == 0x000008, "Wrong alignment on B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly");
static_assert(sizeof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly) == 0x0002C8, "Wrong size on B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, EntryPoint) == 0x000000, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000010, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000018, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_GetInstigator_ReturnValue_1) == 0x000020, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000028, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_CustomEvent_Hide) == 0x000031, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_CustomEvent_Hide' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_IsValid_ReturnValue) == 0x000032, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_IsSkydiving_ReturnValue) == 0x000033, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_IsSkydiving_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_Not_PreBool_ReturnValue) == 0x000034, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_IsDedicatedServer_ReturnValue) == 0x000035, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000038, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000040, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000050, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_CustomEvent_CurrentPoise) == 0x000054, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_CustomEvent_CurrentPoise' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_GetContext_ReturnValue) == 0x000058, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_CustomEvent_Visible) == 0x000060, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_MakeStruct_WeaponHudKeyActionVisibility) == 0x000064, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_MakeStruct_WeaponHudKeyActionVisibility' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_MakeStruct_WeaponHudKeyActionVisibility_1) == 0x00006C, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_MakeStruct_WeaponHudKeyActionVisibility_1' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_Not_PreBool_ReturnValue_1) == 0x000074, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_MakeStruct_WeaponHudKeyActionVisibility_2) == 0x000078, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_MakeStruct_WeaponHudKeyActionVisibility_2' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_MakeArray_Array) == 0x000080, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_Event_HitResult) == 0x000090, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_Event_ImpactPhysicalSurface) == 0x00011C, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_Event_ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_Event_SpawnedPSC) == 0x000120, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_Event_SpawnedPSC' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_bBlockingHit) == 0x000128, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_bInitialOverlap) == 0x000129, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_Time) == 0x00012C, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_Distance) == 0x000130, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_Location) == 0x000134, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_ImpactPoint) == 0x000140, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_Normal) == 0x00014C, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_ImpactNormal) == 0x000158, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_PhysMat) == 0x000168, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_HitActor) == 0x000170, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_HitComponent) == 0x000178, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_HitBoneName) == 0x000180, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_HitItem) == 0x000188, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_FaceIndex) == 0x00018C, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_TraceStart) == 0x000190, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BreakHitResult_TraceEnd) == 0x00019C, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_IsValid_ReturnValue_1) == 0x0001A8, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_GetAnimInstance_ReturnValue) == 0x0001B0, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0001B8, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x0001C8, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001D0, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0001D8, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_BooleanAND_ReturnValue) == 0x000290, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_CustomEvent_Current_Poise) == 0x000294, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_CustomEvent_Current_Poise' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000298, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_IsValid_ReturnValue_2) == 0x000299, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00029A, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x00029B, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x00029C, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, K2Node_CreateDelegate_OutputDelegate) == 0x0002A0, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002B0, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_IsValid_ReturnValue_3) == 0x0002B8, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly, CallFunc_GetContext_ReturnValue_1) == 0x0002C0, "Member 'B_UncleBrolly_C_ExecuteUbergraph_B_UncleBrolly::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");

// Function B_UncleBrolly.B_UncleBrolly_C.Update Audio
// 0x0004 (0x0004 - 0x0000)
struct B_UncleBrolly_C_Update_Audio final
{
public:
	float                                         Current_Poise;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_UncleBrolly_C_Update_Audio) == 0x000004, "Wrong alignment on B_UncleBrolly_C_Update_Audio");
static_assert(sizeof(B_UncleBrolly_C_Update_Audio) == 0x000004, "Wrong size on B_UncleBrolly_C_Update_Audio");
static_assert(offsetof(B_UncleBrolly_C_Update_Audio, Current_Poise) == 0x000000, "Member 'B_UncleBrolly_C_Update_Audio::Current_Poise' has a wrong offset!");

// Function B_UncleBrolly.B_UncleBrolly_C.OnPlayImpactFX
// 0x0098 (0x0098 - 0x0000)
struct B_UncleBrolly_C_OnPlayImpactFX final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              ImpactPhysicalSurface;                             // 0x008C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     SpawnedPSC;                                        // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_UncleBrolly_C_OnPlayImpactFX) == 0x000008, "Wrong alignment on B_UncleBrolly_C_OnPlayImpactFX");
static_assert(sizeof(B_UncleBrolly_C_OnPlayImpactFX) == 0x000098, "Wrong size on B_UncleBrolly_C_OnPlayImpactFX");
static_assert(offsetof(B_UncleBrolly_C_OnPlayImpactFX, HitResult) == 0x000000, "Member 'B_UncleBrolly_C_OnPlayImpactFX::HitResult' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_OnPlayImpactFX, ImpactPhysicalSurface) == 0x00008C, "Member 'B_UncleBrolly_C_OnPlayImpactFX::ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_OnPlayImpactFX, SpawnedPSC) == 0x000090, "Member 'B_UncleBrolly_C_OnPlayImpactFX::SpawnedPSC' has a wrong offset!");

// Function B_UncleBrolly.B_UncleBrolly_C.ToggleAbilityPrompts
// 0x0001 (0x0001 - 0x0000)
struct B_UncleBrolly_C_ToggleAbilityPrompts final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_UncleBrolly_C_ToggleAbilityPrompts) == 0x000001, "Wrong alignment on B_UncleBrolly_C_ToggleAbilityPrompts");
static_assert(sizeof(B_UncleBrolly_C_ToggleAbilityPrompts) == 0x000001, "Wrong size on B_UncleBrolly_C_ToggleAbilityPrompts");
static_assert(offsetof(B_UncleBrolly_C_ToggleAbilityPrompts, Visible) == 0x000000, "Member 'B_UncleBrolly_C_ToggleAbilityPrompts::Visible' has a wrong offset!");

// Function B_UncleBrolly.B_UncleBrolly_C.CurrentPoiseChanged
// 0x0004 (0x0004 - 0x0000)
struct B_UncleBrolly_C_CurrentPoiseChanged final
{
public:
	float                                         Param_CurrentPoise;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_UncleBrolly_C_CurrentPoiseChanged) == 0x000004, "Wrong alignment on B_UncleBrolly_C_CurrentPoiseChanged");
static_assert(sizeof(B_UncleBrolly_C_CurrentPoiseChanged) == 0x000004, "Wrong size on B_UncleBrolly_C_CurrentPoiseChanged");
static_assert(offsetof(B_UncleBrolly_C_CurrentPoiseChanged, Param_CurrentPoise) == 0x000000, "Member 'B_UncleBrolly_C_CurrentPoiseChanged::Param_CurrentPoise' has a wrong offset!");

// Function B_UncleBrolly.B_UncleBrolly_C.ReticleStatusDisplay
// 0x0001 (0x0001 - 0x0000)
struct B_UncleBrolly_C_ReticleStatusDisplay final
{
public:
	bool                                          Hide;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_UncleBrolly_C_ReticleStatusDisplay) == 0x000001, "Wrong alignment on B_UncleBrolly_C_ReticleStatusDisplay");
static_assert(sizeof(B_UncleBrolly_C_ReticleStatusDisplay) == 0x000001, "Wrong size on B_UncleBrolly_C_ReticleStatusDisplay");
static_assert(offsetof(B_UncleBrolly_C_ReticleStatusDisplay, Hide) == 0x000000, "Member 'B_UncleBrolly_C_ReticleStatusDisplay::Hide' has a wrong offset!");

// Function B_UncleBrolly.B_UncleBrolly_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct B_UncleBrolly_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_UncleBrolly_C_UserConstructionScript) == 0x000008, "Wrong alignment on B_UncleBrolly_C_UserConstructionScript");
static_assert(sizeof(B_UncleBrolly_C_UserConstructionScript) == 0x000010, "Wrong size on B_UncleBrolly_C_UserConstructionScript");
static_assert(offsetof(B_UncleBrolly_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_UncleBrolly_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_UncleBrolly_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'B_UncleBrolly_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

}

