#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_FlopperSpawn_World

#include "Basic.hpp"

#include "BGA_Athena_FlopperSpawn_Parent_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_FlopperSpawn_World.BGA_Athena_FlopperSpawn_World_C
// 0x0130 (0x0B40 - 0x0A10)
class ABGA_Athena_FlopperSpawn_World_C final : public ABGA_Athena_FlopperSpawn_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Athena_FlopperSpawn_World_C;    // 0x0A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio_FlopperLoop;                                 // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Flopper_Spot;                                   // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Time_Interval;                                     // 0x0A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetDistance;                                    // 0x0A2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeIntervalOffset;                                // 0x0A30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A34[0x4];                                      // 0x0A34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         NS_FX_Jump;                                        // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_Jump;                                           // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceOffsetAmount;                                 // 0x0A48(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A54[0x4];                                      // 0x0A54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    FortWaterBody;                                     // 0x0A58(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterPlaneOffset;                                  // 0x0A60(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6C[0x4];                                      // 0x0A6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_AmbientFishFlop;                             // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ExplosionItemSpawnOffset;                          // 0x0A78(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A84[0x4];                                      // 0x0A84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  T_FlopperSpawn;                                    // 0x0A88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MinDistanceToExplosion;                            // 0x0AA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AAC[0x4];                                      // 0x0AAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class FName>        MAP_TagToLootExplode;                              // 0x0AB0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   ExplodeItemsToDrop;                                // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExplodeRolls;                                      // 0x0B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterNormalHit;                                    // 0x0B0C(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasWrittenAnalytic;                               // 0x0B18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B19[0x7];                                      // 0x0B19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  BattleLabProjectileTag;                            // 0x0B20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BGA_Athena_FlopperSpawn_World(int32 EntryPoint);
	void SpawnFromExplosion(class AActor* Param_Instigator, class AActor* DamageCauser);
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void SpawnJumpingFish();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	float RandomTimeInterval();
	void OnRep_FortWaterBody();
	void ExplosionQuestProgress(class AActor* Param_Instigator, class AActor* DamageCauser);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_FlopperSpawn_World_C">();
	}
	static class ABGA_Athena_FlopperSpawn_World_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_FlopperSpawn_World_C>();
	}
};
static_assert(alignof(ABGA_Athena_FlopperSpawn_World_C) == 0x000008, "Wrong alignment on ABGA_Athena_FlopperSpawn_World_C");
static_assert(sizeof(ABGA_Athena_FlopperSpawn_World_C) == 0x000B40, "Wrong size on ABGA_Athena_FlopperSpawn_World_C");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, UberGraphFrame_BGA_Athena_FlopperSpawn_World_C) == 0x000A10, "Member 'ABGA_Athena_FlopperSpawn_World_C::UberGraphFrame_BGA_Athena_FlopperSpawn_World_C' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, Audio_FlopperLoop) == 0x000A18, "Member 'ABGA_Athena_FlopperSpawn_World_C::Audio_FlopperLoop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, NS_Flopper_Spot) == 0x000A20, "Member 'ABGA_Athena_FlopperSpawn_World_C::NS_Flopper_Spot' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, Time_Interval) == 0x000A28, "Member 'ABGA_Athena_FlopperSpawn_World_C::Time_Interval' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, OffsetDistance) == 0x000A2C, "Member 'ABGA_Athena_FlopperSpawn_World_C::OffsetDistance' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, TimeIntervalOffset) == 0x000A30, "Member 'ABGA_Athena_FlopperSpawn_World_C::TimeIntervalOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, NS_FX_Jump) == 0x000A38, "Member 'ABGA_Athena_FlopperSpawn_World_C::NS_FX_Jump' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, FX_Jump) == 0x000A40, "Member 'ABGA_Athena_FlopperSpawn_World_C::FX_Jump' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, TraceOffsetAmount) == 0x000A48, "Member 'ABGA_Athena_FlopperSpawn_World_C::TraceOffsetAmount' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, FortWaterBody) == 0x000A58, "Member 'ABGA_Athena_FlopperSpawn_World_C::FortWaterBody' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, WaterPlaneOffset) == 0x000A60, "Member 'ABGA_Athena_FlopperSpawn_World_C::WaterPlaneOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, Sound_AmbientFishFlop) == 0x000A70, "Member 'ABGA_Athena_FlopperSpawn_World_C::Sound_AmbientFishFlop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, ExplosionItemSpawnOffset) == 0x000A78, "Member 'ABGA_Athena_FlopperSpawn_World_C::ExplosionItemSpawnOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, T_FlopperSpawn) == 0x000A88, "Member 'ABGA_Athena_FlopperSpawn_World_C::T_FlopperSpawn' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, MinDistanceToExplosion) == 0x000AA8, "Member 'ABGA_Athena_FlopperSpawn_World_C::MinDistanceToExplosion' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, MAP_TagToLootExplode) == 0x000AB0, "Member 'ABGA_Athena_FlopperSpawn_World_C::MAP_TagToLootExplode' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, ExplodeItemsToDrop) == 0x000B00, "Member 'ABGA_Athena_FlopperSpawn_World_C::ExplodeItemsToDrop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, ExplodeRolls) == 0x000B08, "Member 'ABGA_Athena_FlopperSpawn_World_C::ExplodeRolls' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, WaterNormalHit) == 0x000B0C, "Member 'ABGA_Athena_FlopperSpawn_World_C::WaterNormalHit' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, bHasWrittenAnalytic) == 0x000B18, "Member 'ABGA_Athena_FlopperSpawn_World_C::bHasWrittenAnalytic' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, BattleLabProjectileTag) == 0x000B20, "Member 'ABGA_Athena_FlopperSpawn_World_C::BattleLabProjectileTag' has a wrong offset!");

}

