#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_TimerManager_Lobby

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Generic_TimerManager_Lobby.BP_Generic_TimerManager_Lobby_C
// 0x0048 (0x0260 - 0x0218)
class ABP_Generic_TimerManager_Lobby_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TotalSecondsAtEvent;                               // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              TimeUntilCountdownEnd;                             // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 CalendarEventName;                                 // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FTimerHandle                           CountdownTimerHandle;                              // 0x0248(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Phase3VisualDuration;                              // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           AccuracyTimer;                                     // 0x0258(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Generic_TimerManager_Lobby(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ClearTimerVisuals();
	void CountDownTimer_AccuracyFix();
	void ContinueClockCountdown();
	void VisualUpdateEverySecond();
	void CountdownTimer_New();
	void OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventUpdated_2CA6194447CC90E72CA40FB1A2CD843E(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Generic_TimerManager_Lobby_C">();
	}
	static class ABP_Generic_TimerManager_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Generic_TimerManager_Lobby_C>();
	}
};
static_assert(alignof(ABP_Generic_TimerManager_Lobby_C) == 0x000008, "Wrong alignment on ABP_Generic_TimerManager_Lobby_C");
static_assert(sizeof(ABP_Generic_TimerManager_Lobby_C) == 0x000260, "Wrong size on ABP_Generic_TimerManager_Lobby_C");
static_assert(offsetof(ABP_Generic_TimerManager_Lobby_C, UberGraphFrame) == 0x000218, "Member 'ABP_Generic_TimerManager_Lobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_Lobby_C, DefaultSceneRoot) == 0x000220, "Member 'ABP_Generic_TimerManager_Lobby_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_Lobby_C, TotalSecondsAtEvent) == 0x000228, "Member 'ABP_Generic_TimerManager_Lobby_C::TotalSecondsAtEvent' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_Lobby_C, TimeUntilCountdownEnd) == 0x000230, "Member 'ABP_Generic_TimerManager_Lobby_C::TimeUntilCountdownEnd' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_Lobby_C, CalendarEventName) == 0x000238, "Member 'ABP_Generic_TimerManager_Lobby_C::CalendarEventName' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_Lobby_C, CountdownTimerHandle) == 0x000248, "Member 'ABP_Generic_TimerManager_Lobby_C::CountdownTimerHandle' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_Lobby_C, Phase3VisualDuration) == 0x000250, "Member 'ABP_Generic_TimerManager_Lobby_C::Phase3VisualDuration' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_Lobby_C, AccuracyTimer) == 0x000258, "Member 'ABP_Generic_TimerManager_Lobby_C::AccuracyTimer' has a wrong offset!");

}

