#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FIlteredTextEntryWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FIlteredTextEntryWidget.FilteredTextEntryWidget_C
// 0x08D0 (0x0C10 - 0x0340)
class UFilteredTextEntryWidget_C final : public UFortEditableFilteredCountedTextBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Error;                                             // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Prompt;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ErrorText;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Info;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_119;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputActionWidget;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_InputAction;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WarningImage;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bUseOverrideStyle;                                 // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditableTextBoxStyle                  OverrideStyle;                                     // 0x0398(0x07F0)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bHideValidationInfo;                               // 0x0B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	ETextJustify                                  Justification;                                     // 0x0B89(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowTextPrompt;                                    // 0x0B8A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_B8B[0x5];                                      // 0x0B8B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 PromptTextStyle;                                   // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   PromptText;                                        // 0x0B98(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             OnTextChanged;                                     // 0x0BB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bUseHintText;                                      // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC1[0x7];                                      // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HintText;                                          // 0x0BC8(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnSanitizedTextReady;                              // 0x0BE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnTextCommitByEnter;                               // 0x0BF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          SanitizedTextReady;                                // 0x0C00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnTextChanged__DelegateSignature(const class FText& Text);
	void OnSanitizedTextReady__DelegateSignature(const class FText& Text);
	void OnTextCommitByEnter__DelegateSignature();
	void ExecuteUbergraph_FilteredTextEntryWidget(int32 EntryPoint);
	void BndEvt__EditText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BndEvt__EditText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void PreConstruct(bool IsDesignTime);
	void OnDirtyTextAttempted(bool bIsBadText, bool bAdditionalValidationFailed);
	void Construct();
	void UpdateConfiguration(bool bOverrideStyle, bool bHideValidation, ETextJustify TextJustification, bool bShouldShowTextPrompt, const class FText& PromptDisplayText, class UClass* TextStyle);
	void SetTextFocus();
	void HandleShowPrompt(const class FText& CurrentText);
	void GetCurrentText(class FText* Text);
	void GetErrorText(bool Additional_Validator_Failed, class FText* Appropriate_Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FilteredTextEntryWidget_C">();
	}
	static class UFilteredTextEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFilteredTextEntryWidget_C>();
	}
};
static_assert(alignof(UFilteredTextEntryWidget_C) == 0x000010, "Wrong alignment on UFilteredTextEntryWidget_C");
static_assert(sizeof(UFilteredTextEntryWidget_C) == 0x000C10, "Wrong size on UFilteredTextEntryWidget_C");
static_assert(offsetof(UFilteredTextEntryWidget_C, UberGraphFrame) == 0x000340, "Member 'UFilteredTextEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Error) == 0x000348, "Member 'UFilteredTextEntryWidget_C::Error' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, CommonTextBlock_Prompt) == 0x000350, "Member 'UFilteredTextEntryWidget_C::CommonTextBlock_Prompt' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, ErrorText) == 0x000358, "Member 'UFilteredTextEntryWidget_C::ErrorText' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, HorizontalBox_Info) == 0x000360, "Member 'UFilteredTextEntryWidget_C::HorizontalBox_Info' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Image_119) == 0x000368, "Member 'UFilteredTextEntryWidget_C::Image_119' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Image_Selected) == 0x000370, "Member 'UFilteredTextEntryWidget_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, InputActionWidget) == 0x000378, "Member 'UFilteredTextEntryWidget_C::InputActionWidget' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Overlay_InputAction) == 0x000380, "Member 'UFilteredTextEntryWidget_C::Overlay_InputAction' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, WarningImage) == 0x000388, "Member 'UFilteredTextEntryWidget_C::WarningImage' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, bUseOverrideStyle) == 0x000390, "Member 'UFilteredTextEntryWidget_C::bUseOverrideStyle' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, OverrideStyle) == 0x000398, "Member 'UFilteredTextEntryWidget_C::OverrideStyle' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, bHideValidationInfo) == 0x000B88, "Member 'UFilteredTextEntryWidget_C::bHideValidationInfo' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, Justification) == 0x000B89, "Member 'UFilteredTextEntryWidget_C::Justification' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, ShowTextPrompt) == 0x000B8A, "Member 'UFilteredTextEntryWidget_C::ShowTextPrompt' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, PromptTextStyle) == 0x000B90, "Member 'UFilteredTextEntryWidget_C::PromptTextStyle' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, PromptText) == 0x000B98, "Member 'UFilteredTextEntryWidget_C::PromptText' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, OnTextChanged) == 0x000BB0, "Member 'UFilteredTextEntryWidget_C::OnTextChanged' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, bUseHintText) == 0x000BC0, "Member 'UFilteredTextEntryWidget_C::bUseHintText' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, HintText) == 0x000BC8, "Member 'UFilteredTextEntryWidget_C::HintText' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, OnSanitizedTextReady) == 0x000BE0, "Member 'UFilteredTextEntryWidget_C::OnSanitizedTextReady' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, OnTextCommitByEnter) == 0x000BF0, "Member 'UFilteredTextEntryWidget_C::OnTextCommitByEnter' has a wrong offset!");
static_assert(offsetof(UFilteredTextEntryWidget_C, SanitizedTextReady) == 0x000C00, "Member 'UFilteredTextEntryWidget_C::SanitizedTextReady' has a wrong offset!");

}

