#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Special_Knockback

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Special_Knockback.GA_Special_Knockback_C.ExecuteUbergraph_GA_Special_Knockback
// 0x05D8 (0x05D8 - 0x0000)
struct GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetCurrentSafeZonePhase_ReturnValue;      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSafeZoneLocation_OutLocation;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSafeZoneLocation_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x00B8(0x00B8)(ContainsInstancedReference)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0180(0x00B8)(ContainsInstancedReference)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_2;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_3;           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0304(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SelfActor;                      // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0334(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x03E4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FF[0x1];                                      // 0x03FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena_1;         // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_4;           // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_422[0x6];                                      // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0440(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0464(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0480(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0488(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x04A8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x04BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x04E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue_1;         // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51A[0x2];                                      // 0x051A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_1;        // 0x052A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52B[0x1];                                      // 0x052B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_1;            // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_2;        // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532[0x2];                                      // 0x0532(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_2;            // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_3;        // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x3];                                      // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_3;            // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_4;        // 0x0542(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_543[0x1];                                      // 0x0543(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_4;            // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x054C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x055C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_2;         // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue_1;      // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x058C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0598(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_5;        // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A5[0x3];                                      // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_5;            // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B2[0x2];                                      // 0x05B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x05B4(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback) == 0x000008, "Wrong alignment on GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback");
static_assert(sizeof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback) == 0x0005D8, "Wrong size on GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, EntryPoint) == 0x000000, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_WaitDelay_ReturnValue) == 0x000038, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, Temp_bool_IsClosed_Variable) == 0x000041, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, Temp_bool_Has_Been_Initd_Variable) == 0x000042, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, Temp_bool_Has_Been_Initd_Variable_1) == 0x000043, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_GetCurrentSafeZonePhase_ReturnValue) == 0x000044, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_GetCurrentSafeZonePhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_GetSafeZoneLocation_OutLocation) == 0x000054, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_GetSafeZoneLocation_OutLocation' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_GetSafeZoneLocation_ReturnValue) == 0x000060, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_GetSafeZoneLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_BreakVector_X) == 0x000064, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_BreakVector_Y) == 0x000068, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_BreakVector_Z) == 0x00006C, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000070, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Normal_ReturnValue) == 0x00007C, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CreateDelegate_OutputDelegate_3) == 0x000088, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000098, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0000B0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0000B8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000170, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x000180, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000238, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000240, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_IsValid_ReturnValue_1) == 0x000248, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_IsValid_ReturnValue_2) == 0x000249, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000250, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000258, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000260, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_bSuccess_1) == 0x000268, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000270, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_bSuccess_2) == 0x000278, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00027C, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Add_FloatFloat_ReturnValue) == 0x000288, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x00028C, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000298, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Normal_ReturnValue_1) == 0x00029C, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002A8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x0002B0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3) == 0x0002B8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_AsFort_Player_Pawn_2) == 0x0002C0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_AsFort_Player_Pawn_2' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_bSuccess_3) == 0x0002C8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_AsFort_Player_Pawn_3) == 0x0002D0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_AsFort_Player_Pawn_3' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_bSuccess_4) == 0x0002D8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0002E0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0002F0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_WaitGameplayTagAdd_ReturnValue_1) == 0x0002F8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_WaitGameplayTagAdd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_IsValid_ReturnValue_3) == 0x000300, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CreateDelegate_OutputDelegate_5) == 0x000304, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CustomEvent_SelfActor) == 0x000318, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CustomEvent_SelfActor' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CustomEvent_OtherActor) == 0x000320, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CustomEvent_NormalImpulse) == 0x000328, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CustomEvent_Hit) == 0x000334, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_RandomFloatInRange_ReturnValue) == 0x0003C0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_AsBuilding_Actor) == 0x0003C8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_bSuccess_5) == 0x0003D0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x0003D8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_IsValid_ReturnValue_4) == 0x0003E0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CreateDelegate_OutputDelegate_6) == 0x0003E4, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, Temp_bool_IsClosed_Variable_1) == 0x0003F4, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0003F8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0003FC, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Not_PreBool_ReturnValue) == 0x0003FD, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_BooleanAND_ReturnValue) == 0x0003FE, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4) == 0x000400, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_AsPlayer_Pawn_Athena_1) == 0x000408, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_AsPlayer_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_bSuccess_6) == 0x000410, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_AsFort_Player_Pawn_4) == 0x000418, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_AsFort_Player_Pawn_4' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_DynamicCast_bSuccess_7) == 0x000420, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_IsDedicatedServer_ReturnValue) == 0x000421, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, Temp_object_Variable) == 0x000428, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, Temp_object_Variable_1) == 0x000430, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000438, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, Temp_struct_Variable) == 0x000440, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_HasTag_ReturnValue) == 0x000460, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CreateDelegate_OutputDelegate_7) == 0x000464, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000474, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CustomEvent_GameState) == 0x000478, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CustomEvent_Playlist) == 0x000480, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CustomEvent_PlaylistContextTags) == 0x000488, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_CreateDelegate_OutputDelegate_8) == 0x0004A8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_FClamp_ReturnValue) == 0x0004B8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0004BC, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_BreakVector_X_1) == 0x0004C8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_BreakVector_Y_1) == 0x0004CC, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_BreakVector_Z_1) == 0x0004D0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0004D4, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0004D8, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_SelectFloat_ReturnValue) == 0x0004DC, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_MakeVector_ReturnValue) == 0x0004E0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_FClamp_ReturnValue_1) == 0x0004EC, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0004F0, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0004FC, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_GetGameStateAthena_ReturnValue) == 0x000508, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_GetGameStateAthena_ReturnValue_1) == 0x000510, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_GetGameStateAthena_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_SwitchEnum_CmpSuccess) == 0x000518, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000519, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_EvaluateCurveTableRow_OutXY) == 0x00051C, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_SwitchEnum_CmpSuccess_1) == 0x000520, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_FTrunc_ReturnValue) == 0x000524, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_SwitchEnum_CmpSuccess_2) == 0x000528, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_Conv_IntToBool_ReturnValue) == 0x000529, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_EvaluateCurveTableRow_OutResult_1) == 0x00052A, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_EvaluateCurveTableRow_OutResult_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_EvaluateCurveTableRow_OutXY_1) == 0x00052C, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_EvaluateCurveTableRow_OutXY_1' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, K2Node_SwitchEnum_CmpSuccess_3) == 0x000530, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_EvaluateCurveTableRow_OutResult_2) == 0x000531, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_EvaluateCurveTableRow_OutResult_2' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_EvaluateCurveTableRow_OutXY_2) == 0x000534, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_EvaluateCurveTableRow_OutXY_2' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_EvaluateCurveTableRow_OutResult_3) == 0x000538, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_EvaluateCurveTableRow_OutResult_3' has a wrong offset!");
static_assert(offsetof(GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback, CallFunc_EvaluateCurveTableRow_OutXY_3) == 0x00053C, "Member 'GA_Special_Knockback_C_ExecuteUbergraph_GA_Special_Knockback::CallFunc_EvaluateCurveTableRow_OutXY_3' has a wrong offset!");
