#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Rebirth_Soldier_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Rebirth_Soldier_AnimBP.M_MED_Rebirth_Soldier_AnimBP_C
// 0x43C0 (0x4810 - 0x0450)
class UM_MED_Rebirth_Soldier_AnimBP_C final : public UCustomCharacterPartAnimInstance_Rebirth_Soldier_M
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0458(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0488(0x0140)(ContainsInstancedReference)
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3;                         // 0x05D0(0x05A0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x0B70(0x05A0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x1110(0x05A0)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_16;                       // 0x16B0(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x17B8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x17D8(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_15;                       // 0x17F8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_14;                       // 0x1900(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_13;                       // 0x1A08(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_12;                       // 0x1B10(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_22;                       // 0x1C18(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_21;                       // 0x1D20(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_20;                       // 0x1E28(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_19;                       // 0x1F30(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_18;                       // 0x2038(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0x2140(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0x2248(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_11;                       // 0x2350(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0x2458(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x2560(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_10;                       // 0x2668(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2770(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2828(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x2850(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x2870(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2890(0x00A0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x2930(0x05A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2ED0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2EF8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2F18(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_9;                        // 0x2F38(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x3040(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_8;                        // 0x3148(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_7;                        // 0x3250(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x3358(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x3460(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x3568(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x3670(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x3778(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x3880(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x3988(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x3A90(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x3B98(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x3CA0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x3DA8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x3EB0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x3FB8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x40C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x41C8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x42D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x43D8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x44E0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x45E8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x46F0(0x0108)()
	float                                         Crouching_alpha;                                   // 0x47F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Targeting_alpha;                                   // 0x47FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ar_firingPosition;                                 // 0x4800(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_Rebirth_Soldier_AnimBP(int32 EntryPoint);
	void OnBeginCrouching();
	void OnEndCrouching();
	void OnEndTargeting();
	void OnBeginTargeting();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Rebirth_Soldier_AnimBP_C">();
	}
	static class UM_MED_Rebirth_Soldier_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Rebirth_Soldier_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Rebirth_Soldier_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Rebirth_Soldier_AnimBP_C");
static_assert(sizeof(UM_MED_Rebirth_Soldier_AnimBP_C) == 0x004810, "Wrong size on UM_MED_Rebirth_Soldier_AnimBP_C");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, UberGraphFrame) == 0x000450, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Root) == 0x000458, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000488, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_RigidBody_3) == 0x0005D0, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_RigidBody_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_RigidBody_2) == 0x000B70, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x001110, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_16) == 0x0016B0, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_16' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x0017B8, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x0017D8, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_15) == 0x0017F8, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_15' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_14) == 0x001900, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_14' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_13) == 0x001A08, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_13' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_12) == 0x001B10, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_12' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_22) == 0x001C18, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_22' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_21) == 0x001D20, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_21' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_20) == 0x001E28, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_20' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_19) == 0x001F30, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_19' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_18) == 0x002038, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_18' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_17) == 0x002140, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_17' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_16) == 0x002248, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_16' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_11) == 0x002350, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_11' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_15) == 0x002458, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_15' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_14) == 0x002560, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_14' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_10) == 0x002668, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_10' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002770, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x002828, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x002850, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x002870, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x002890, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_RigidBody) == 0x002930, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x002ED0, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002EF8, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002F18, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_9) == 0x002F38, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_9' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_13) == 0x003040, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_8) == 0x003148, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_8' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_7) == 0x003250, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_6) == 0x003358, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_5) == 0x003460, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_4) == 0x003568, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_3) == 0x003670, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_2) == 0x003778, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint_1) == 0x003880, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Constraint) == 0x003988, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_12) == 0x003A90, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_11) == 0x003B98, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_10) == 0x003CA0, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_9) == 0x003DA8, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_8) == 0x003EB0, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_7) == 0x003FB8, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x0040C0, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x0041C8, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x0042D0, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x0043D8, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x0044E0, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0045E8, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0046F0, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, Crouching_alpha) == 0x0047F8, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::Crouching_alpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, Targeting_alpha) == 0x0047FC, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::Targeting_alpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Rebirth_Soldier_AnimBP_C, Ar_firingPosition) == 0x004800, "Member 'UM_MED_Rebirth_Soldier_AnimBP_C::Ar_firingPosition' has a wrong offset!");

}

