#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SafeZoneIndicator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function SafeZoneIndicator.SafeZoneIndicator_C.OnSafeZoneStateChangeDispatcher__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature final
{
public:
	EFortSafeZoneState                            Param_SafeZoneState;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature) == 0x000001, "Wrong alignment on SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature");
static_assert(sizeof(SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature) == 0x000001, "Wrong size on SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature");
static_assert(offsetof(SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature, Param_SafeZoneState) == 0x000000, "Member 'SafeZoneIndicator_C_OnSafeZoneStateChangeDispatcher__DelegateSignature::Param_SafeZoneState' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.ExecuteUbergraph_SafeZoneIndicator
// 0x03B0 (0x03B0 - 0x0000)
struct SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0048(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0078(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCreativeModePlaylist_ReturnValue;       // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAnyListenersWithinRange_ReturnValue;   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_6;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable_2;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAmbientAudioDataAsset*                 K2Node_DynamicCast_AsAmbient_Audio_Data_Asset;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh_1;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_5;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_6;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_7;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance_1;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_8;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_NewParam;                       // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameState_C*                    CallFunc_GetAthenaGameState_AthenaGS;              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSinceSafeZonesStart_ReturnValue;   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E3[0x1];                                      // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRandomPointInPlayerDir_Position;       // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Map_Find_Value;                           // 0x024C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x0290(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetRandomPointOnBoundary_Position;        // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSafeZoneState                            K2Node_Event_NewState;                             // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInitial;                             // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB[0x1];                                      // 0x02BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Map_Find_Value_1;                         // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_4;        // 0x02C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsPlayingReplay_ReturnValue;           // 0x02D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D6[0x2];                                      // 0x02D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_9;            // 0x02D8(0x0010)(ZeroConstructor, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_10;           // 0x031C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_11;           // 0x032C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E[0x2];                                      // 0x033E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue; // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_376[0x2];                                      // 0x0376(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_12;           // 0x0378(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsErebus_ReturnValue_1;                   // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x038B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator");
static_assert(sizeof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator) == 0x0003B0, "Wrong size on SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, EntryPoint) == 0x000000, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000030, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_GameState) == 0x000038, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_Playlist) == 0x000040, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_PlaylistContextTags) == 0x000048, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, Temp_struct_Variable) == 0x000078, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, Temp_object_Variable) == 0x000098, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_HasTag_ReturnValue) == 0x0000A0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, Temp_object_Variable_1) == 0x0000A8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x0000B0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_IsCreativeModePlaylist_ReturnValue) == 0x0000B9, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_IsCreativeModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_BooleanOR_ReturnValue) == 0x0000BA, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_IsValid_ReturnValue_1) == 0x0000BB, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000BC, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_AreAnyListenersWithinRange_ReturnValue) == 0x0000C8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_AreAnyListenersWithinRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_MakeStruct_LinearColor) == 0x0000CC, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_Loaded_6) == 0x0000E0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_Loaded_6' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, Temp_object_Variable_2) == 0x0000F8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_AsAmbient_Audio_Data_Asset) == 0x000100, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_AsAmbient_Audio_Data_Asset' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_Loaded_5) == 0x000110, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, Temp_object_Variable_3) == 0x000118, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_AsStatic_Mesh) == 0x000120, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_Loaded_4) == 0x000130, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, Temp_object_Variable_4) == 0x000138, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_AsStatic_Mesh_1) == 0x000140, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_AsStatic_Mesh_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_bSuccess_2) == 0x000148, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_Loaded_3) == 0x000150, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, Temp_object_Variable_5) == 0x000158, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_AsParticle_System) == 0x000160, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_bSuccess_3) == 0x000168, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_Loaded_2) == 0x000170, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, Temp_object_Variable_6) == 0x000178, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_AsMaterial_Instance) == 0x000180, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_bSuccess_4) == 0x000188, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_Loaded_1) == 0x000190, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, Temp_object_Variable_7) == 0x000198, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_AsMaterial_Instance_1) == 0x0001A0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_AsMaterial_Instance_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_bSuccess_5) == 0x0001A8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_Loaded) == 0x0001B0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, Temp_object_Variable_8) == 0x0001B8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_AsSound_Base) == 0x0001C0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_DynamicCast_bSuccess_6) == 0x0001C8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CustomEvent_NewParam) == 0x0001CC, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetAthenaGameState_AthenaGS) == 0x0001D0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetAthenaGameState_AthenaGS' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetTimeSinceSafeZonesStart_ReturnValue) == 0x0001D8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetTimeSinceSafeZonesStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x0001DC, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x0001E0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Not_PreBool_ReturnValue) == 0x0001E1, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Greater_IntInt_ReturnValue) == 0x0001E2, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001E4, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0001E8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001EC, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x0001F0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001F8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000208, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_Event_DeltaSeconds) == 0x000210, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_5) == 0x000214, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000224, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Add_VectorVector_ReturnValue) == 0x000230, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00023C, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetRandomPointInPlayerDir_Position) == 0x000240, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetRandomPointInPlayerDir_Position' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Map_Find_Value) == 0x00024C, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Map_Find_ReturnValue) == 0x000254, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_6) == 0x000258, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_BreakVector2D_X) == 0x000268, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_BreakVector2D_Y) == 0x00026C, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_RandomFloatInRange_ReturnValue) == 0x000270, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000278, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_7) == 0x000280, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_8) == 0x000290, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetRandomPointOnBoundary_Position) == 0x0002A0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetRandomPointOnBoundary_Position' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002AC, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_Event_NewState) == 0x0002B8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_Event_bInitial) == 0x0002B9, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_Event_bInitial' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_SwitchEnum_CmpSuccess) == 0x0002BA, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Map_Find_Value_1) == 0x0002BC, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Map_Find_ReturnValue_1) == 0x0002C0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_K2_SetTimerDelegate_ReturnValue_4) == 0x0002C8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_K2_SetTimerDelegate_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetTimelineLength_ReturnValue) == 0x0002D0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002D4, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetIsPlayingReplay_ReturnValue) == 0x0002D5, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetIsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_9) == 0x0002D8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0002E8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetVectorParameterValue_ReturnValue) == 0x0002F0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000300, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_FMax_ReturnValue) == 0x000304, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000308, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00030C, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Add_FloatFloat_ReturnValue) == 0x000310, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000314, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_IsMobilePlatform_ReturnValue) == 0x000318, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_10) == 0x00031C, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_11) == 0x00032C, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_IsDedicatedServer_ReturnValue) == 0x00033C, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x00033D, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x000340, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x000348, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000350, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue) == 0x000354, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000358, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetGameUserSettings_ReturnValue) == 0x000360, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue) == 0x000368, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1) == 0x000370, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000374, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_IsErebus_ReturnValue) == 0x000375, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_IsErebus_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_CreateDelegate_OutputDelegate_12) == 0x000378, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_BooleanOR_ReturnValue_1) == 0x000388, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_IsErebus_ReturnValue_1) == 0x000389, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_IsErebus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_BooleanOR_ReturnValue_2) == 0x00038A, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_SetStaticMesh_ReturnValue) == 0x00038B, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_SetStaticMesh_ReturnValue_1) == 0x00038C, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000390, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000398, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_EvaluateCurveTableRow_OutResult) == 0x0003A0, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_EvaluateCurveTableRow_OutXY) == 0x0003A4, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0003A8, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, K2Node_SwitchEnum_CmpSuccess_1) == 0x0003A9, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.OnSafeZoneStateChange
// 0x0002 (0x0002 - 0x0000)
struct SafeZoneIndicator_C_OnSafeZoneStateChange final
{
public:
	EFortSafeZoneState                            NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitial;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SafeZoneIndicator_C_OnSafeZoneStateChange) == 0x000001, "Wrong alignment on SafeZoneIndicator_C_OnSafeZoneStateChange");
