#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_M_Med_Soldier_04_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_M_Med_Soldier_04_Skeleton_AnimBP.SK_M_Med_Soldier_04_Skeleton_AnimBP_C
// 0x1EF0 (0x2320 - 0x0430)
class USK_M_Med_Soldier_04_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance_Soldier
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0438(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0468(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0488(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x04A8(0x0140)(ContainsInstancedReference)
	uint8                                         Pad_5E8[0x8];                                      // 0x05E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x05F0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x0A30(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x0E70(0x0440)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x12B0(0x05A0)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x1850(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x1958(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x1A60(0x0108)()
	uint8                                         Pad_1B68[0x8];                                     // 0x1B68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x1B70(0x05A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x2110(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2218(0x0108)()

public:
	void ExecuteUbergraph_SK_M_Med_Soldier_04_Skeleton_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_M_Med_Soldier_04_Skeleton_AnimBP_C">();
	}
	static class USK_M_Med_Soldier_04_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_M_Med_Soldier_04_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C) == 0x000010, "Wrong alignment on USK_M_Med_Soldier_04_Skeleton_AnimBP_C");
static_assert(sizeof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C) == 0x002320, "Wrong size on USK_M_Med_Soldier_04_Skeleton_AnimBP_C");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, UberGraphFrame) == 0x000430, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_Root) == 0x000438, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000468, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000488, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0004A8, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x0005F0, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x000A30, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x000E70, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x0012B0, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_Constraint_2) == 0x001850, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_Constraint_1) == 0x001958, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_Constraint) == 0x001A60, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_RigidBody) == 0x001B70, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x002110, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002218, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

