#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMapBoundActionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialMapBoundActionButton.SpatialMapBoundActionButton_C
// 0x0030 (0x0BB0 - 0x0B80)
class USpatialMapBoundActionButton_C final : public UCommonBoundActionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x0B88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0B90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Container;                                  // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Control;                                   // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SpatialMapBoundActionButton(int32 EntryPoint);
	void BP_OnClicked();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void PreConstruct(bool IsDesignTime);
	void Construct();

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialMapBoundActionButton_C">();
	}
	static class USpatialMapBoundActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMapBoundActionButton_C>();
	}
};
static_assert(alignof(USpatialMapBoundActionButton_C) == 0x000008, "Wrong alignment on USpatialMapBoundActionButton_C");
static_assert(sizeof(USpatialMapBoundActionButton_C) == 0x000BB0, "Wrong size on USpatialMapBoundActionButton_C");
static_assert(offsetof(USpatialMapBoundActionButton_C, UberGraphFrame) == 0x000B80, "Member 'USpatialMapBoundActionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialMapBoundActionButton_C, Pressed) == 0x000B88, "Member 'USpatialMapBoundActionButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(USpatialMapBoundActionButton_C, Hover) == 0x000B90, "Member 'USpatialMapBoundActionButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USpatialMapBoundActionButton_C, Border_Container) == 0x000B98, "Member 'USpatialMapBoundActionButton_C::Border_Container' has a wrong offset!");
static_assert(offsetof(USpatialMapBoundActionButton_C, ButtonBacking) == 0x000BA0, "Member 'USpatialMapBoundActionButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USpatialMapBoundActionButton_C, SizeBox_Control) == 0x000BA8, "Member 'USpatialMapBoundActionButton_C::SizeBox_Control' has a wrong offset!");

}

