#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpecialLayer_Swim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SpecialLayer_Swim.SpecialLayer_Swim_C
// 0x10D0 (0x13F0 - 0x0320)
class USpecialLayer_Swim_C final : public UFortLiveEventLayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0328(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0358(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x03C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03F8(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0490(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x04B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x04E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0508(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0530(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0558(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x0580(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0660(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0690(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0770(0x0030)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x07A0(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0850(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x08C8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0940(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x09B8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0A30(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0AA8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0AD8(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0B00(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0BE0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0C10(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0C88(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0CB8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0D68(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0D98(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0E10(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0EB0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0F28(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0F58(0x00B0)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x1008(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x1190(0x0188)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1318(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x13B8(0x0030)()

public:
	void ExecuteUbergraph_SpecialLayer_Swim(int32 EntryPoint);
	void AnimNotify_UW_Swim_Start_FullyBlended();
	void AnimNotify_UW_Idle_Exited();
	void AnimNotify_UW_Idle_FullyBlended();
	void UW_Swim_Start_Entered();
	void AnimNotify_UW_Swim_Start_Entered();
	void UW_Swim_Stop_Exited();
	void UW_Swim_Stop_FullyBlended();
	void UW_Swim_Stop_Entered();
	void AnimNotify_UW_Swim_Stop_Exited();
	void AnimNotify_UW_Swim_Stop_FullyBlended();
	void AnimNotify_UW_Swim_Stop_Entered();
	void UpdateValuesFromCameraManager_Implementation(class APlayerCameraManager* CameraManager);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void CustomLocomotionFullBodyLayer(const struct FPoseLink& PassThroughCustomFullBody, struct FPoseLink* Param_CustomLocomotionFullBodyLayer);
	void CustomLocomotionPreIKLayer(const struct FPoseLink& InPosePreIK, struct FPoseLink* Param_CustomLocomotionPreIKLayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpecialLayer_Swim_C">();
	}
	static class USpecialLayer_Swim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpecialLayer_Swim_C>();
	}
};
static_assert(alignof(USpecialLayer_Swim_C) == 0x000010, "Wrong alignment on USpecialLayer_Swim_C");
static_assert(sizeof(USpecialLayer_Swim_C) == 0x0013F0, "Wrong size on USpecialLayer_Swim_C");
static_assert(offsetof(USpecialLayer_Swim_C, UberGraphFrame) == 0x000320, "Member 'USpecialLayer_Swim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_Root_2) == 0x000328, "Member 'USpecialLayer_Swim_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_LinkedInputPose_1) == 0x000358, "Member 'USpecialLayer_Swim_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_Root_1) == 0x0003C8, "Member 'USpecialLayer_Swim_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_LinkedInputPose) == 0x0003F8, "Member 'USpecialLayer_Swim_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_TransitionResult_7) == 0x000468, "Member 'USpecialLayer_Swim_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_TransitionResult_6) == 0x000490, "Member 'USpecialLayer_Swim_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_TransitionResult_5) == 0x0004B8, "Member 'USpecialLayer_Swim_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_TransitionResult_4) == 0x0004E0, "Member 'USpecialLayer_Swim_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_TransitionResult_3) == 0x000508, "Member 'USpecialLayer_Swim_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_TransitionResult_2) == 0x000530, "Member 'USpecialLayer_Swim_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_TransitionResult_1) == 0x000558, "Member 'USpecialLayer_Swim_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_BlendSpacePlayer_2) == 0x000580, "Member 'USpecialLayer_Swim_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_StateResult_6) == 0x000660, "Member 'USpecialLayer_Swim_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000690, "Member 'USpecialLayer_Swim_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_StateResult_5) == 0x000770, "Member 'USpecialLayer_Swim_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_BlendListByEnum) == 0x0007A0, "Member 'USpecialLayer_Swim_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_SequencePlayer_7) == 0x000850, "Member 'USpecialLayer_Swim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_SequencePlayer_6) == 0x0008C8, "Member 'USpecialLayer_Swim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_SequencePlayer_5) == 0x000940, "Member 'USpecialLayer_Swim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_SequencePlayer_4) == 0x0009B8, "Member 'USpecialLayer_Swim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_SequencePlayer_3) == 0x000A30, "Member 'USpecialLayer_Swim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_StateResult_4) == 0x000AA8, "Member 'USpecialLayer_Swim_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_TransitionResult) == 0x000AD8, "Member 'USpecialLayer_Swim_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_BlendSpacePlayer) == 0x000B00, "Member 'USpecialLayer_Swim_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_StateResult_3) == 0x000BE0, "Member 'USpecialLayer_Swim_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_SequencePlayer_2) == 0x000C10, "Member 'USpecialLayer_Swim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_StateResult_2) == 0x000C88, "Member 'USpecialLayer_Swim_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_StateMachine_1) == 0x000CB8, "Member 'USpecialLayer_Swim_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_StateResult_1) == 0x000D68, "Member 'USpecialLayer_Swim_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_SequencePlayer_1) == 0x000D98, "Member 'USpecialLayer_Swim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_BlendListByBool_1) == 0x000E10, "Member 'USpecialLayer_Swim_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_SequencePlayer) == 0x000EB0, "Member 'USpecialLayer_Swim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_StateResult) == 0x000F28, "Member 'USpecialLayer_Swim_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_StateMachine) == 0x000F58, "Member 'USpecialLayer_Swim_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_RotationOffsetBlendSpace_1) == 0x001008, "Member 'USpecialLayer_Swim_C::AnimGraphNode_RotationOffsetBlendSpace_1' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x001190, "Member 'USpecialLayer_Swim_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_BlendListByBool) == 0x001318, "Member 'USpecialLayer_Swim_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(USpecialLayer_Swim_C, AnimGraphNode_Root) == 0x0013B8, "Member 'USpecialLayer_Swim_C::AnimGraphNode_Root' has a wrong offset!");

}

