#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpecialLayer_Swim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SpecialLayer_Swim.SpecialLayer_Swim_C.ExecuteUbergraph_SpecialLayer_Swim
// 0x0004 (0x0004 - 0x0000)
struct SpecialLayer_Swim_C_ExecuteUbergraph_SpecialLayer_Swim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpecialLayer_Swim_C_ExecuteUbergraph_SpecialLayer_Swim) == 0x000004, "Wrong alignment on SpecialLayer_Swim_C_ExecuteUbergraph_SpecialLayer_Swim");
static_assert(sizeof(SpecialLayer_Swim_C_ExecuteUbergraph_SpecialLayer_Swim) == 0x000004, "Wrong size on SpecialLayer_Swim_C_ExecuteUbergraph_SpecialLayer_Swim");
static_assert(offsetof(SpecialLayer_Swim_C_ExecuteUbergraph_SpecialLayer_Swim, EntryPoint) == 0x000000, "Member 'SpecialLayer_Swim_C_ExecuteUbergraph_SpecialLayer_Swim::EntryPoint' has a wrong offset!");

// Function SpecialLayer_Swim.SpecialLayer_Swim_C.UpdateValuesFromCameraManager_Implementation
// 0x0008 (0x0008 - 0x0000)
struct SpecialLayer_Swim_C_UpdateValuesFromCameraManager_Implementation final
{
public:
	class APlayerCameraManager*                   CameraManager;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpecialLayer_Swim_C_UpdateValuesFromCameraManager_Implementation) == 0x000008, "Wrong alignment on SpecialLayer_Swim_C_UpdateValuesFromCameraManager_Implementation");
static_assert(sizeof(SpecialLayer_Swim_C_UpdateValuesFromCameraManager_Implementation) == 0x000008, "Wrong size on SpecialLayer_Swim_C_UpdateValuesFromCameraManager_Implementation");
static_assert(offsetof(SpecialLayer_Swim_C_UpdateValuesFromCameraManager_Implementation, CameraManager) == 0x000000, "Member 'SpecialLayer_Swim_C_UpdateValuesFromCameraManager_Implementation::CameraManager' has a wrong offset!");

// Function SpecialLayer_Swim.SpecialLayer_Swim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SpecialLayer_Swim_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SpecialLayer_Swim_C_AnimGraph) == 0x000008, "Wrong alignment on SpecialLayer_Swim_C_AnimGraph");
static_assert(sizeof(SpecialLayer_Swim_C_AnimGraph) == 0x000010, "Wrong size on SpecialLayer_Swim_C_AnimGraph");
static_assert(offsetof(SpecialLayer_Swim_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'SpecialLayer_Swim_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function SpecialLayer_Swim.SpecialLayer_Swim_C.CustomLocomotionFullBodyLayer
// 0x0020 (0x0020 - 0x0000)
struct SpecialLayer_Swim_C_CustomLocomotionFullBodyLayer final
{
public:
	struct FPoseLink                              PassThroughCustomFullBody;                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_CustomLocomotionFullBodyLayer;               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SpecialLayer_Swim_C_CustomLocomotionFullBodyLayer) == 0x000008, "Wrong alignment on SpecialLayer_Swim_C_CustomLocomotionFullBodyLayer");
static_assert(sizeof(SpecialLayer_Swim_C_CustomLocomotionFullBodyLayer) == 0x000020, "Wrong size on SpecialLayer_Swim_C_CustomLocomotionFullBodyLayer");
static_assert(offsetof(SpecialLayer_Swim_C_CustomLocomotionFullBodyLayer, PassThroughCustomFullBody) == 0x000000, "Member 'SpecialLayer_Swim_C_CustomLocomotionFullBodyLayer::PassThroughCustomFullBody' has a wrong offset!");
static_assert(offsetof(SpecialLayer_Swim_C_CustomLocomotionFullBodyLayer, Param_CustomLocomotionFullBodyLayer) == 0x000010, "Member 'SpecialLayer_Swim_C_CustomLocomotionFullBodyLayer::Param_CustomLocomotionFullBodyLayer' has a wrong offset!");

// Function SpecialLayer_Swim.SpecialLayer_Swim_C.CustomLocomotionPreIKLayer
// 0x0020 (0x0020 - 0x0000)
struct SpecialLayer_Swim_C_CustomLocomotionPreIKLayer final
{
public:
	struct FPoseLink                              InPosePreIK;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_CustomLocomotionPreIKLayer;                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SpecialLayer_Swim_C_CustomLocomotionPreIKLayer) == 0x000008, "Wrong alignment on SpecialLayer_Swim_C_CustomLocomotionPreIKLayer");
static_assert(sizeof(SpecialLayer_Swim_C_CustomLocomotionPreIKLayer) == 0x000020, "Wrong size on SpecialLayer_Swim_C_CustomLocomotionPreIKLayer");
static_assert(offsetof(SpecialLayer_Swim_C_CustomLocomotionPreIKLayer, InPosePreIK) == 0x000000, "Member 'SpecialLayer_Swim_C_CustomLocomotionPreIKLayer::InPosePreIK' has a wrong offset!");
static_assert(offsetof(SpecialLayer_Swim_C_CustomLocomotionPreIKLayer, Param_CustomLocomotionPreIKLayer) == 0x000010, "Member 'SpecialLayer_Swim_C_CustomLocomotionPreIKLayer::Param_CustomLocomotionPreIKLayer' has a wrong offset!");

}

