#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_Galileo_Gondola_Body

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CCPM_Galileo_Gondola_Body.CCPM_Galileo_Gondola_Body_C.ExecuteUbergraph_CCPM_Galileo_Gondola_Body
// 0x0060 (0x0060 - 0x0000)
struct CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0010(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body) == 0x000008, "Wrong alignment on CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body");
static_assert(sizeof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body) == 0x000060, "Wrong size on CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, EntryPoint) == 0x000000, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::EntryPoint' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000008, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, CallFunc_GetChildrenComponents_Children) == 0x000010, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, Temp_int_Array_Index_Variable) == 0x000024, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, CallFunc_Array_Get_Item) == 0x000030, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000038, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000048, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000050, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00005C, "Member 'CCPM_Galileo_Gondola_Body_C_ExecuteUbergraph_CCPM_Galileo_Gondola_Body::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

