#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_Galileo_Gondola_Body

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CCPM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_Galileo_Gondola_Body.CCPM_Galileo_Gondola_Body_C
// 0x0020 (0x03D8 - 0x03B8)
class ACCPM_Galileo_Gondola_Body_C final : public ACCPM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_Galileo_Gondola_Body_C;        // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               HoloProjection;                                    // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_TurnOn_6FC1BE574EF07ADF7DFFE89260BB382F; // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_6FC1BE574EF07ADF7DFFE89260BB382F; // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CCPM_Galileo_Gondola_Body(int32 EntryPoint);
	void TesTurnOn();
	void OnPawnAndPartChanged();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_Galileo_Gondola_Body_C">();
	}
	static class ACCPM_Galileo_Gondola_Body_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_Galileo_Gondola_Body_C>();
	}
};
static_assert(alignof(ACCPM_Galileo_Gondola_Body_C) == 0x000008, "Wrong alignment on ACCPM_Galileo_Gondola_Body_C");
static_assert(sizeof(ACCPM_Galileo_Gondola_Body_C) == 0x0003D8, "Wrong size on ACCPM_Galileo_Gondola_Body_C");
static_assert(offsetof(ACCPM_Galileo_Gondola_Body_C, UberGraphFrame_CCPM_Galileo_Gondola_Body_C) == 0x0003B8, "Member 'ACCPM_Galileo_Gondola_Body_C::UberGraphFrame_CCPM_Galileo_Gondola_Body_C' has a wrong offset!");
static_assert(offsetof(ACCPM_Galileo_Gondola_Body_C, HoloProjection) == 0x0003C0, "Member 'ACCPM_Galileo_Gondola_Body_C::HoloProjection' has a wrong offset!");
static_assert(offsetof(ACCPM_Galileo_Gondola_Body_C, Timeline_0_TurnOn_6FC1BE574EF07ADF7DFFE89260BB382F) == 0x0003C8, "Member 'ACCPM_Galileo_Gondola_Body_C::Timeline_0_TurnOn_6FC1BE574EF07ADF7DFFE89260BB382F' has a wrong offset!");
static_assert(offsetof(ACCPM_Galileo_Gondola_Body_C, Timeline_0__Direction_6FC1BE574EF07ADF7DFFE89260BB382F) == 0x0003CC, "Member 'ACCPM_Galileo_Gondola_Body_C::Timeline_0__Direction_6FC1BE574EF07ADF7DFFE89260BB382F' has a wrong offset!");
static_assert(offsetof(ACCPM_Galileo_Gondola_Body_C, Timeline_0) == 0x0003D0, "Member 'ACCPM_Galileo_Gondola_Body_C::Timeline_0' has a wrong offset!");

}

