#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Galileo_Gondola_AnimBp

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Galileo_Gondola_AnimBp.M_MED_Galileo_Gondola_AnimBp_C
// 0x10E0 (0x1500 - 0x0420)
class UM_MED_Galileo_Gondola_AnimBp_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0458(0x0140)(ContainsInstancedReference)
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x05A0(0x05A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0B40(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x0B60(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0B80(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0BA0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0CA8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0DB0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0EB8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0FC0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x10C8(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x11D0(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x1270(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1290(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1348(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1370(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1398(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x13B8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x13D8(0x0108)()
	float                                         Crouching_alpha;                                   // 0x14E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Jump_alpha;                                        // 0x14E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Gravity_override;                                  // 0x14E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Thigh_up_l;                                        // 0x14F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Thigh_up_r;                                        // 0x14F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Galileo_Gondola_AnimBp_C">();
	}
	static class UM_MED_Galileo_Gondola_AnimBp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Galileo_Gondola_AnimBp_C>();
	}
};
static_assert(alignof(UM_MED_Galileo_Gondola_AnimBp_C) == 0x000010, "Wrong alignment on UM_MED_Galileo_Gondola_AnimBp_C");
static_assert(sizeof(UM_MED_Galileo_Gondola_AnimBp_C) == 0x001500, "Wrong size on UM_MED_Galileo_Gondola_AnimBp_C");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, UberGraphFrame) == 0x000420, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_Root) == 0x000428, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_CopyPoseFromMesh) == 0x000458, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_RigidBody) == 0x0005A0, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_LocalToComponentSpace_2) == 0x000B40, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x000B60, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000B80, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_ModifyBone_6) == 0x000BA0, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_ModifyBone_5) == 0x000CA8, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_ModifyBone_4) == 0x000DB0, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_ModifyBone_3) == 0x000EB8, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_ModifyBone_2) == 0x000FC0, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_ModifyBone_1) == 0x0010C8, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_BlendListByBool) == 0x0011D0, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x001270, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_SaveCachedPose) == 0x001290, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_UseCachedPose_1) == 0x001348, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_UseCachedPose) == 0x001370, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_LocalToComponentSpace) == 0x001398, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_ComponentToLocalSpace) == 0x0013B8, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, AnimGraphNode_ModifyBone) == 0x0013D8, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, Crouching_alpha) == 0x0014E0, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::Crouching_alpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, Jump_alpha) == 0x0014E4, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::Jump_alpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, Gravity_override) == 0x0014E8, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::Gravity_override' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, Thigh_up_l) == 0x0014F4, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::Thigh_up_l' has a wrong offset!");
static_assert(offsetof(UM_MED_Galileo_Gondola_AnimBp_C, Thigh_up_r) == 0x0014F8, "Member 'UM_MED_Galileo_Gondola_AnimBp_C::Thigh_up_r' has a wrong offset!");

}

