#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Galileo_Gondola_AnimBp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function M_MED_Galileo_Gondola_AnimBp.M_MED_Galileo_Gondola_AnimBp_C.ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp
// 0x0100 (0x0100 - 0x0000)
struct M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1; // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp) == 0x000010, "Wrong alignment on M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp");
static_assert(sizeof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp) == 0x000100, "Wrong size on M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, EntryPoint) == 0x000000, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000004, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x000020, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1) == 0x000050, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakTransform_Location) == 0x000058, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakTransform_Rotation) == 0x000064, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakTransform_Scale) == 0x000070, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1) == 0x000080, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakRotator_Roll) == 0x0000B0, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakRotator_Pitch) == 0x0000B4, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakRotator_Yaw) == 0x0000B8, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakTransform_Location_1) == 0x0000BC, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakTransform_Rotation_1) == 0x0000C8, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakTransform_Scale_1) == 0x0000D4, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_MapRangeClamped_ReturnValue) == 0x0000E0, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakRotator_Roll_1) == 0x0000E4, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakRotator_Pitch_1) == 0x0000E8, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_BreakRotator_Yaw_1) == 0x0000EC, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0000F0, "Member 'M_MED_Galileo_Gondola_AnimBp_C_ExecuteUbergraph_M_MED_Galileo_Gondola_AnimBp::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");

// Function M_MED_Galileo_Gondola_AnimBp.M_MED_Galileo_Gondola_AnimBp_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_MED_Galileo_Gondola_AnimBp_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Galileo_Gondola_AnimBp_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_MED_Galileo_Gondola_AnimBp_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_MED_Galileo_Gondola_AnimBp_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_MED_Galileo_Gondola_AnimBp_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_MED_Galileo_Gondola_AnimBp_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_MED_Galileo_Gondola_AnimBp.M_MED_Galileo_Gondola_AnimBp_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_MED_Galileo_Gondola_AnimBp_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_MED_Galileo_Gondola_AnimBp_C_AnimGraph) == 0x000008, "Wrong alignment on M_MED_Galileo_Gondola_AnimBp_C_AnimGraph");
static_assert(sizeof(M_MED_Galileo_Gondola_AnimBp_C_AnimGraph) == 0x000010, "Wrong size on M_MED_Galileo_Gondola_AnimBp_C_AnimGraph");
static_assert(offsetof(M_MED_Galileo_Gondola_AnimBp_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'M_MED_Galileo_Gondola_AnimBp_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

