#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Male_Medium_Galileo_Gondola_Head_AnimBp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Male_Medium_Galileo_Gondola_Head_AnimBp.Male_Medium_Galileo_Gondola_Head_AnimBp_C
// 0x0180 (0x05A0 - 0x0420)
class UMale_Medium_Galileo_Gondola_Head_AnimBp_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0458(0x0140)(ContainsInstancedReference)

public:
	void ExecuteUbergraph_Male_Medium_Galileo_Gondola_Head_AnimBp(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Male_Medium_Galileo_Gondola_Head_AnimBp_C">();
	}
	static class UMale_Medium_Galileo_Gondola_Head_AnimBp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMale_Medium_Galileo_Gondola_Head_AnimBp_C>();
	}
};
static_assert(alignof(UMale_Medium_Galileo_Gondola_Head_AnimBp_C) == 0x000010, "Wrong alignment on UMale_Medium_Galileo_Gondola_Head_AnimBp_C");
static_assert(sizeof(UMale_Medium_Galileo_Gondola_Head_AnimBp_C) == 0x0005A0, "Wrong size on UMale_Medium_Galileo_Gondola_Head_AnimBp_C");
static_assert(offsetof(UMale_Medium_Galileo_Gondola_Head_AnimBp_C, UberGraphFrame) == 0x000420, "Member 'UMale_Medium_Galileo_Gondola_Head_AnimBp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMale_Medium_Galileo_Gondola_Head_AnimBp_C, AnimGraphNode_Root) == 0x000428, "Member 'UMale_Medium_Galileo_Gondola_Head_AnimBp_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMale_Medium_Galileo_Gondola_Head_AnimBp_C, AnimGraphNode_CopyPoseFromMesh) == 0x000458, "Member 'UMale_Medium_Galileo_Gondola_Head_AnimBp_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");

}

